spoemb/linkit-v4-core/ports/nrf52840/core/hardware/smd_sat/smd_sat.cpp
void SmdSat::state_error_exit() {}

void SmdSat::state_error() {
	SMD_STATE_CHANGE(error, stopped);
}

void SmdSat::state_stopped_enter() {
	m_cmd.deinit();

	// Release wakeup pin LOW so SMD can enter deep sleep (STANDBY/SHUTDOWN)
	// before power is cut. This allows the STM32 to enter LPM immediately.
#ifdef SAT_EXTWAKEUP
	GPIOPins::clear(SAT_EXTWAKEUP);
#endif

	this->shutdown();
	GPIOPins::release_sensors_pwr();
	nrf_gpio_cfg_default(BSP::GPIO_Inits[SAT_RESET].pin_number);

	// Force KMAC reload on next boot — the STM32WL may have lost its state
	// after power cycle (shutdown cuts VDD, NVM needs re-initialization).
	// v4.0.9 behavior: always reload KMAC after any stop/restart cycle.
	is_kmac_profil_loaded = false;

	m_packet_buffer.clear();

	notify(KineisEventPowerOff({}));
}

void SmdSat::state_stopped_exit() {}
void SmdSat::state_stopped() {}

void SmdSat::state_powering_on_enter() {}

void SmdSat::state_powering_on_exit() {
	m_next_delay = SMDSAT_SPI_BOOT_DELAY_MS;
}

void SmdSat::state_powering_on() {
	DEBUG_TRACE("SmdSat::%s: Starting power-on sequence", __func__);

	GPIOPins::acquire_sensors_pwr();

	// Step 0: Force a clean power cycle — kill any residual power from previous session.
	// After a nRF soft reset, SAT_PWR_EN may have been HIGH and the STM32WL
	// is still alive on VDD decoupling caps with a stale SPI sequence counter.
	// Without this, the first 2-phase write fails with INVALID_CMD.
	GPIOPins::init_pin(SAT_RESET);
	GPIOPins::clear(SAT_RESET);
	GPIOPins::clear(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	nrf_delay_ms(200);  // Allow VDD caps to fully discharge (100ms insufficient for some boards)

	// Step 1: Assert RESET LOW before powering on — hold STM32WL in reset
	// during VDD ramp-up to prevent undefined behavior at low voltage.
	GPIOPins::clear(SAT_RESET);

	// Step 2: Assert wakeup pin HIGH (LinkIt only) before power-on
#ifdef SAT_EXTWAKEUP
	GPIOPins::init_pin(SAT_EXTWAKEUP);
	GPIOPins::set(SAT_EXTWAKEUP);
#endif

	// Step 3: Power ON — VPA stays LOW (PA regulator not needed until TX)
	GPIOPins::set(SAT_PWR_EN);
#ifdef SMD_VPA_PIN
	GPIOPins::drive_low(SMD_VPA_PIN);
#endif
	DEBUG_TRACE("SmdSat::%s: SAT_PWR_EN=HIGH, RESET=LOW, VPA=LOW", __func__);

	// Step 4: Wait for VDD stabilization (150ms >> 5ms required)
	nrf_delay_ms(SMDSAT_DELAY_POWER_ON_MS);

	// Step 5: Release RESET — pull-up on SMD VDD rail pulls HIGH → STM32WL boots
	GPIOPins::release_to_highz(SAT_RESET);
	DEBUG_TRACE("SmdSat::%s: RESET released, VPA held LOW until ping OK", __func__);

	SMD_STATE_CHANGE(powering_on, idle_pending);
}

void SmdSat::state_load_kmac_enter() {
	m_state_counter = 20;  // MAC poll iterations before timeout
	// Do NOT set m_next_delay here — the first call writes RCONF/credentials
	// (steps 1-2) and must execute promptly after ping OK.  The 500ms delay
	// is only appropriate for MAC polling retries (step 3) and is set there.
}
void SmdSat::state_load_kmac_exit() {}

void SmdSat::state_load_kmac() {
	// Sequence per firmware spec:
	// 1. Write RCONF/credentials (flash operations — don't need MAC_OK)
	// 2. Load KMAC (triggers KNS_MAC_INIT with the RCONF now in flash)
	// 3. Poll READ_SPIMAC_STATE (0x27) until MAC_OK
	// Writing credentials BEFORE KMAC is critical: KMAC init reads RCONF
	// from flash, so the flash must contain valid data first.

	// Step 1a: Apply deferred RCONF from switch_modulation() while stopped.
	if (!m_pending_rconf.empty()) {
		DEBUG_INFO("SmdSat::%s: applying deferred RCONF for modulation %d", __func__, static_cast<int>(m_modulation));
		auto wait_cmd = []() { nrf_delay_ms(SMDSAT_DELAY_CMD_MS * 2); };  // 60ms (v4.0.9 timing)
		std::string rconf_bin = Binascii::unhexlify(m_pending_rconf);
		smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
		                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
		try {
			m_cmd.set_radio_conf(&rconf_struct);
			wait_cmd();
			m_cmd.save_radio_conf();
			wait_cmd();
			m_credentials_written = true;
			is_kmac_profil_loaded = false;  // Force KMAC reload with new RCONF
			DEBUG_INFO("SmdSat::%s: deferred RCONF applied OK", __func__);
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: failed to apply deferred RCONF — continuing with previous config", __func__);
		}
		m_pending_rconf.clear();
	}

	// Step 1b: Write credentials if changed via DTE.
	if (!m_credentials_written) {
		m_credentials_written = true;
		if (configuration_store && configuration_store->is_credentials_dirty()) {
			DEBUG_INFO("SmdSat::%s: credentials dirty, writing to SMD", __func__);
			if (!write_credentials_from_config()) {
				DEBUG_ERROR("SmdSat::%s: credential write failed", __func__);
				SMD_STATE_CHANGE(load_kmac, error);
				return;
			}
			configuration_store->clear_credentials_dirty();
			is_kmac_profil_loaded = false;  // Force KMAC reload with new credentials
		}
	}

	// Step 2: Load KMAC profile — triggers KNS_MAC_INIT on the STM32.
	// The MAC reads RCONF from flash during init, so credentials must be
	// written first (step 1). KMAC load is idempotent — safe to call even
	// if already loaded (just re-inits the MAC).
	if (!is_kmac_profil_loaded) {
		try {
			m_cmd.load_kmac_profil(1);
			is_kmac_profil_loaded = true;
		} catch (...) {
			DEBUG_ERROR("SmdSat::%s: KMAC load failed", __func__);
			SMD_STATE_CHANGE(load_kmac, error);
			return;
		}
	}

	// Step 3: Poll READ_SPIMAC_STATE (0x27) for MAC_OK.
	uint8_t spi_st = 0, mac_st = 0;
	try { m_cmd.read_spimac_state(&spi_st, &mac_st); } catch (...) {}
	if (mac_st == MAC_OK) {
		// Write TCXO warmup — RAM register on STM32, lost on power cycle.
		try {
			m_cmd.write_tcxo_warmup(m_tcxo_warmup_time * 1000);
			DEBUG_TRACE("SmdSat::%s: TCXO warmup written: %u s", __func__, m_tcxo_warmup_time);
		} catch (...) {
			DEBUG_WARN("SmdSat::%s: failed to write TCXO warmup", __func__);
		}

		// Write LPM mode if not NONE — RAM register on STM32.
		if (m_lpm_mode != 0x01) {
			try {
				m_cmd.write_lpm(&m_lpm_mode);
				DEBUG_INFO("SmdSat::%s: LPM mode written: 0x%02X", __func__, m_lpm_mode);
			} catch (...) {
				DEBUG_WARN("SmdSat::%s: failed to write LPM mode", __func__);
			}
		}

		SMD_STATE_CHANGE(load_kmac, idle_pending);
	} else if (mac_st == MAC_ERROR && !m_rconf_recovery_attempted) {
		// Recovery: MAC_ERROR after KMAC load means the RCONF in STM32 flash
		// is corrupted or missing. Force-write the master RCONF from config store,
		// save to flash, then re-attempt KMAC load. This can happen after a
		// previous test corrupted the STM32 flash, or on first boot with
		// adaptive modulation where RCONF was never written.
		m_rconf_recovery_attempted = true;
		DEBUG_WARN("SmdSat::%s: MAC_ERROR after KMAC — attempting RCONF recovery", __func__);
		if (configuration_store) {
			std::string radioconf = configuration_store->read_param<std::string>(ParamID::ARGOS_RADIOCONF);
			if (!radioconf.empty() && radioconf.size() >= 2 && (radioconf.size() % 2) == 0) {
				auto wait_cmd = []() { nrf_delay_ms(150); };
				std::string rconf_bin = Binascii::unhexlify(radioconf);
				smd_uint8_array_t rconf_struct = {static_cast<uint16_t>(rconf_bin.size()),
				                                  reinterpret_cast<uint8_t *>(rconf_bin.data())};
				try {
					m_cmd.set_radio_conf(&rconf_struct);
					wait_cmd();
					m_cmd.save_radio_conf();
					wait_cmd();
					is_kmac_profil_loaded = false;  // Force re-attempt
					m_state_counter = 10;  // Reset poll counter for MAC_OK after recovery
					DEBUG_INFO("SmdSat::%s: RCONF recovery written — retrying KMAC", __func__);
					m_next_delay = SMDSAT_DELAY_CMD_MS;
					return;  // Re-enter state_load_kmac on next tick
				} catch (...) {
					DEBUG_ERROR("SmdSat::%s: RCONF recovery write failed", __func__);
				}
			}
		}
		SMD_STATE_CHANGE(load_kmac, error);
	} else {
		if (--m_state_counter == 0) {
			DEBUG_ERROR("SmdSat::%s: MAC not OK after KMAC load (spi=%u mac=%u)", __func__, spi_st, mac_st);
			SMD_STATE_CHANGE(load_kmac, error);
		} else {
			m_next_delay = SMDSAT_DELAY_LOAD_KMAC_MS;
		}
	}
}

void SmdSat::state_idle_pending_enter() {
	// Init SPI here (after power-on + reset release) to avoid MISO backfeed.
	// STM32WL has booted and its GPIOs are in a defined state now.
	m_cmd.init();
	m_next_delay = SMDSAT_DELAY_CMD_MS;
	m_state_counter = 10;
}

